{
  "common": {
    "home": "หน้าแรก",
    "about": "เกี่ยวกับฉัน",
    "portfolio": "ผลงาน",
    "contact": "ติดต่อ",
    "language": "ภาษา"
  },
  "navigation": {
    "home": "หน้าแรก",
    "about": "เกี่ยวกับฉัน",
    "portfolio": "ผลงาน",
    "contact": "ติดต่อ"
  },
  "home": {
    "title": "ผลงาน",
    "profile": {
      "name": "ตะวัน จันทร์กระจ่าง",
      "title": "Full-Stack Developer",
      "experience": "ประสบการณ์ 2 ปี",
      "description": "ฉันเชี่ยวชาญในการสร้างเว็บแอปพลิเคชันแบบไดนามิกโดยใช้เทคโนโลยีสมัยใหม่ ความเชี่ยวชาญของฉันรวมถึงการพัฒนา front-end ด้วย React, การพัฒนา back-end ด้วย Node.js และการจัดการฐานข้อมูลด้วย PostgreSQL ฉันมีความหลงใหลในการสร้างโซลูชันที่ขยายตัวได้และใช้งานง่าย",
      "viewWork": "ดูผลงานของฉัน"
    }
  },
  "about": {
    "title": "เกี่ยวกับฉัน",
    "skills": "ทักษะ",
    "experience": "ประสบการณ์",
    "education": "การศึกษา",
    "share": "แชร์"
  },
  "portfolio": {
    "title": "ผลงาน",
    "projects": "โปรเจกต์",
    "viewProject": "ดูโปรเจกต์",
    "projectDetails": "รายละเอียดโปรเจกต์",
    "technologies": "เทคโนโลยี",
    "category": {
      "webDevelopment": "การพัฒนาเว็บ",
      "mobileApp": "แอปมือถือ",
      "uiDesign": "การออกแบบ UI/UX"
    }
  },
  "contact": {
    "title": "ติดต่อ",
    "getInTouch": "ติดต่อกับฉัน",
    "description": "ปัจจุบันฉันกำลังมองหาโอกาสใหม่และอยากได้ยินจากคุณ ไม่ว่าคุณจะมีโปรเจกต์ในใจหรือแค่อยากติดต่อ สามารถติดต่อมาได้เลย",
    "form": {
      "name": "ชื่อ",
      "email": "อีเมล",
      "message": "ข้อความ",
      "namePlaceholder": "ชื่อเต็มของคุณ",
      "emailPlaceholder": "your.email@example.com",
      "messagePlaceholder": "เล่าให้ฟังเกี่ยวกับโปรเจกต์ ไอเดีย หรือแค่ทักทายก็ได้! ฉันอยากได้ยินจากคุณ",
      "nameHelp": "กรอกชื่อเต็มตามที่คุณต้องการให้เรียก",
      "emailHelp": "ฉันจะใช้อีเมลนี้ในการตอบกลับ",
      "messageHelp": "แบ่งปันความคิด รายละเอียดโปรเจกต์ หรือไอเดียการร่วมงาน",
      "required": "จำเป็น",
      "sendMessage": "ส่งข้อความ",
      "sending": "กำลังส่งข้อความ...",
      "sent": "ส่งข้อความแล้ว!",
      "success": {
        "title": "ส่งข้อความสำเร็จ!",
        "description": "ฉันจะติดต่อกลับโดยเร็วที่สุด"
      },
      "error": {
        "title": "ไม่สามารถส่งข้อความได้",
        "network": "เกิดข้อผิดพลาดเครือข่าย กรุณาตรวจสอบการเชื่อมต่อและลองใหม่",
        "validation": "กรุณาตรวจสอบข้อมูลที่กรอกและลองใหม่",
        "rateLimit": "ส่งข้อความมากเกินไป กรุณารอสักครู่ก่อนลองใหม่",
        "cooldown": "กรุณารอสักครู่ก่อนส่งใหม่"
      },
      "validation": {
        "nameRequired": "จำเป็นต้องกรอกชื่อ",
        "nameMinLength": "ชื่อต้องมีอย่างน้อย 2 ตัวอักษร",
        "nameMaxLength": "ชื่อต้องไม่เกิน 50 ตัวอักษร",
        "namePattern": "ชื่อสามารถใช้ได้เฉพาะตัวอักษร ช่องว่าง เครื่องหมายขีด เครื่องหมายอะพอสทรอฟี และจุด",
        "emailRequired": "จำเป็นต้องกรอกอีเมล",
        "emailInvalid": "กรุณากรอกอีเมลที่ถูกต้อง",
        "emailMaxLength": "อีเมลต้องไม่เกิน 100 ตัวอักษร",
        "messageRequired": "จำเป็นต้องกรอกข้อความ",
        "messageMinLength": "ข้อความต้องมีอย่างน้อย 10 ตัวอักษร",
        "messageMaxLength": "ข้อความต้องไม่เกิน 1000 ตัวอักษร"
      },
      "draft": "บันทึกร่างอัตโนมัติแล้ว",
      "keyboardShortcut": "กด Ctrl + Enter เพื่อส่งด่วน",
      "allFieldsRequired": "จำเป็นต้องกรอกทุกช่อง",
      "characterCount": "ตัวอักษร",
      "approachingLimit": "ใกล้ถึงขีดจำกัด",
      "overLimit": "เกินขีดจำกัด"
    },
    "social": {
      "title": "ติดต่อกับฉัน",
      "linkedin": "LinkedIn",
      "github": "GitHub",
      "twitter": "Twitter"
    }
  },
  "projects": {
    "title": "Featured Projects",
    "categories": {
      "webDevelopment": "พัฒนาเว็บไซต์",
      "mobileDevelopment": "พัฒนาแอปมือถือ",
      "dataScience": "วิทยาการข้อมูล"
    },
    "ecommercePlatform": {
      "title": "แพลตฟอร์มอีคอมเมิร์ซ",
      "description": "พัฒนาแพลตฟอร์มอีคอมเมิร์ซที่ครบครันพร้อมระบบยืนยันตัวตน แคตตาล็อกสินค้า ตะกร้าสินค้า และการรวมระบบชำระเงิน",
      "detailTitle": "แพลตฟอร์มอีคอมเมิร์ซสำหรับสินค้าหัตถกรรม",
      "detailDescription": "โปรเจกต์นี้เกี่ยวข้องกับการพัฒนาแพลตฟอร์มอีคอมเมิร์ซที่ครอบคลุมสำหรับกลุ่มช่างฝีมือท้องถิ่น ทำให้พวกเขาสามารถจัดแสดงและขายผลงานหัตถกรรมออนไลน์ได้ แพลตฟอร์มรองรับการแสดงรายการสินค้า บัญชีผู้ใช้ ฟังก์ชันตะกร้าสินค้า และการประมวลผลการชำระเงินที่ปลอดภัย",
      "role": "ในฐานะนักพัฒนาฟูลสแตคหลัก ฉันรับผิดชอบวงจรการพัฒนาทั้งหมด ตั้งแต่แนวคิดและการออกแบบเบื้องต้นจนถึงการปรับใช้และการบำรุงรักษาอย่างต่อเนื่อง การมีส่วนร่วมของฉันรวมถึงการออกแบบสคีมาฐานข้อมูล การใช้งาน API แบ็กเอนด์ การพัฒนาอินเทอร์เฟซผู้ใช้ส่วนหน้า และการรวมเกตเวย์การชำระเงิน"
    },
    "socialMediaDashboard": {
      "title": "แดชบอร์ดโซเชียลมีเดีย",
      "description": "สร้างแดชบอร์ดโซเชียลมีเดียเพื่อจัดการหลายบัญชี จัดตารางโพสต์ และวิเคราะห์เมตริกการมีส่วนร่วม",
      "detailTitle": "แดชบอร์ดการจัดการโซเชียลมีเดีย",
      "detailDescription": "พัฒนาแพลตฟอร์มการจัดการโซเชียลมีเดียที่ครอบคลุม ช่วยให้ธุรกิจสามารถจัดการหลายบัญชีโซเชียล จัดตารางโพสต์ ติดตามเมตริกการมีส่วนร่วม และวิเคราะห์ประสิทธิภาพในแพลตฟอร์มต่างๆ รวมถึง Facebook, Twitter, Instagram และ LinkedIn",
      "role": "ฉันทำหน้าที่เป็นสถาปนิกส่วนหน้าและนักพัฒนาหลักสำหรับโปรเจกต์นี้ ความรับผิดชอบของฉันรวมถึงการออกแบบอินเทอร์เฟซผู้ใช้ การใช้งานคอมโพเนนต์การแสดงภาพข้อมูลแบบเรียลไทม์ การรวมกับ API โซเชียลมีเดียหลายตัว และการสร้างแดชบอร์ดที่ตอบสนองได้ซึ่งทำงานได้อย่างราบรื่นในทุกอุปกรณ์"
    },
    "personalBlog": {
      "title": "บล็อกส่วนตัว",
      "description": "ออกแบบและพัฒนาบล็อกส่วนตัวพร้อม CMS กำหนดเอง ทำให้สามารถสร้างและจัดการเนื้อหาได้อย่างง่ายดาย",
      "detailTitle": "บล็อกส่วนตัวพร้อมระบบจัดการเนื้อหากำหนดเอง",
      "detailDescription": "สร้างแพลตฟอร์มบล็อกส่วนตัวที่ทันสมัยพร้อมระบบจัดการเนื้อหากำหนดเอง บล็อกมีการออกแบบที่สะอาดและตอบสนอง รองรับ markdown ระบบความคิดเห็น และการเพิ่มประสิทธิภาพ SEO ผู้ใช้สามารถสร้าง แก้ไข และเผยแพร่โพสต์บล็อกพร้อมเนื้อหามีเดียที่หลากหลายได้อย่างง่ายดาย",
      "role": "ฉันเป็นนักพัฒนาเพียงคนเดียวในโปรเจกต์นี้ ดูแลทั้งการออกแบบและการพัฒนา ฉันสร้าง CMS กำหนดเองตั้งแต่เริ่มต้น ใช้งานอินเทอร์เฟซบล็อกส่วนหน้า สร้างแดชบอร์ดผู้ดูแลระบบสำหรับการจัดการเนื้อหา และเพิ่มประสิทธิภาพไซต์สำหรับเครื่องมือค้นหาและประสิทธิภาพ"
    },
    "mobileApp": {
      "title": "แอปติดตามการออกกำลังกาย",
      "description": "สร้างแอปมือถือข้ามแพลตฟอร์มสำหรับการติดตามการออกกำลังกายพร้อมแผนการออกกำลังกาย การตรวจสอบความก้าวหน้า และฟีเจอร์โซเชียล",
      "detailTitle": "แอปพลิเคชันมือถือติดตามการออกกำลังกาย",
      "detailDescription": "พัฒนาแอปพลิเคชันมือถือติดตามการออกกำลังกายที่ครอบคลุมโดยใช้ React Native แอปรวมถึงการวางแผนการออกกำลังกาย การติดตามความก้าวหน้า การบันทึกโภชนาการ ฟีเจอร์โซเชียล และการรวมกับอุปกรณ์สวมใส่ ผู้ใช้สามารถตั้งเป้าหมาย ติดตามการเดินทางการออกกำลังกาย และเชื่อมต่อกับเพื่อนๆ เพื่อแรงบันดาลใจ",
      "role": "ฉันเป็นผู้นำทีมพัฒนามือถือและรับผิดชอบสถาปัตยกรรมแอป การใช้งาน UI/UX การรวมกับ API การออกกำลังกาย และการเพิ่มประสิทธิภาพ ฉันยังจัดการกระบวนการปรับใช้แอปสโตร์สำหรับทั้งแพลตฟอร์ม iOS และ Android"
    },
    "dataVisualization": {
      "title": "แดชบอร์ดการแสดงภาพข้อมูล",
      "description": "สร้างแดชบอร์ดแบบอินเทอร์แอคทีฟสำหรับการแสดงภาพชุดข้อมูลที่ซับซ้อนพร้อมการอัพเดตแบบเรียลไทม์และตัวเลือกการกรองแบบกำหนดเอง",
      "detailTitle": "แดชบอร์ดการแสดงภาพข้อมูลแบบอินเทอร์แอคทีฟ",
      "detailDescription": "สร้างแดชบอร์ดการแสดงภาพข้อมูลที่ซับซ้อนสำหรับการวิเคราะห์ชุดข้อมูลทางธุรกิจที่ซับซ้อน แพลตฟอร์มมีแผนภูมิแบบอินเทอร์แอคทีฟ การอัพเดตข้อมูลแบบเรียลไทม์ ตัวเลือกการกรองแบบกำหนดเอง และความสามารถในการส่งออก ช่วยให้ธุรกิจตัดสินใจโดยใช้ข้อมูลผ่านการแสดงภาพที่ชัดเจนของเมตริกสำคัญ",
      "role": "ฉันเป็นนักพัฒนาส่วนหน้าหลักที่เชี่ยวชาญด้านการแสดงภาพข้อมูล ฉันออกแบบและใช้งานสถาปัตยกรรมแดชบอร์ด สร้างคอมโพเนนต์แผนภูมิแบบกำหนดเอง รวมกับแหล่งข้อมูลหลายแห่ง และเพิ่มประสิทธิภาพสำหรับการจัดการชุดข้อมูลขนาดใหญ่แบบเรียลไทม์"
    },
    "buttonText": "ดูโปรเจกต์",
    "sections": {
      "myRole": "บทบาทของฉัน",
      "technologiesUsed": "เทคโนโลยีที่ใช้",
      "visualShowcase": "การแสดงผลงาน"
    }
  }
}
