{
  "common": {
    "home": "หน้าแรก",
    "about": "เกี่ยวกับฉัน",
    "portfolio": "ผลงาน",
    "contact": "ติดต่อ",
    "language": "ภาษา"
  },
  "navigation": {
    "home": "หน้าแรก",
    "about": "เกี่ยวกับฉัน",
    "portfolio": "ผลงาน",
    "contact": "ติดต่อ"
  },
  "home": {
    "title": "ผลงาน",
    "profile": {
      "name": "ตะวัน จันทร์กระจ่าง",
      "title": "Full-Stack Developer",
      "experience": "ประสบการณ์ 2 ปี",
      "description": "สวัสดีครับ ผมชื่อ ตะวัน จันทร์กระจ่าง เป็น Full Stack Developer มีประสบการณ์กว่า 2 ปี เริ่มทำงานตั้งแต่เรียนมหาวิทยาลัย ชอบเรียนรู้เทคโนโลยีใหม่ ๆ และกำลังหางานที่ตรงกับความสามารถและความสนใจครับ",
      "viewWork": "ดูผลงานของฉัน"
    }
  },
  "about": {
    "title": "เกี่ยวกับฉัน",
    "description": "ฉันเป็นนักพัฒนาฟูลสแตคที่มุ่งมั่นพร้อมประสบการณ์สองปีในการสร้างเว็บแอปพลิเคชันแบบไดนามิก ความเชี่ยวชาญของฉันครอบคลุมทั้งเทคโนโลยีส่วนหน้าและส่วนหลัง ทำให้สามารถส่งมอบโซลูชันที่ครอบคลุมและปรับแต่งตามความต้องการของโปรเจกต์ที่หลากหลาย ฉันมีความหลงใหลในการสร้างแอปพลิเคชันที่มีประสิทธิภาพ ขยายตัวได้ และใช้งานง่าย",
    "skills": "ทักษะ",
    "experience": "ประสบการณ์",
    "education": "การศึกษา",
    "university": "มหาวิทยาลัยเจ้าพระยา",
    "faculty": "คณะวิทยาศาสตร์และเทคโนโลยี สาขาวิทยาการคอมพิวเตอร์",
    "experienceYears": "2 ปี",
    "jobTitle": "นักพัฒนาฟูลสแตค",
    "share": "แชร์"
  },
  "portfolio": {
    "title": "ผลงาน",
    "projects": "โปรเจกต์",
    "viewProject": "ดูโปรเจกต์",
    "projectDetails": "รายละเอียดโปรเจกต์",
    "technologies": "เทคโนโลยี",
    "category": {
      "webDevelopment": "การพัฒนาเว็บ",
      "mobileApp": "แอปมือถือ",
      "uiDesign": "การออกแบบ UI/UX"
    }
  },
  "contact": {
    "title": "ติดต่อ",
    "getInTouch": "ติดต่อกับฉัน",
    "description": "ตอนนี้ผมกำลังมองหาโอกาสใหม่ ๆ และยินดีมากถ้าได้พูดคุยกับคุณ ไม่ว่าคุณจะมีโปรเจกต์ที่สนใจหรือต้องการติดต่อกัน ก็สามารถทักมาคุยกันได้เลยครับ",
    "form": {
      "name": "ชื่อ",
      "email": "อีเมล",
      "message": "ข้อความ",
      "namePlaceholder": "ชื่อเต็มของคุณ",
      "emailPlaceholder": "your.email@example.com",
      "messagePlaceholder": "พูดคุยเกี่ยวกับโปรเจกต์ ไอเดีย หรือแค่ทักทายก็ได้! ผมอยากพูดคุยกับคุณ",
      "nameHelp": "กรอกชื่อเต็มตามที่คุณต้องการให้เรียก",
      "emailHelp": "ฉันจะใช้อีเมลนี้ในการตอบกลับ",
      "messageHelp": "แบ่งปันความคิด รายละเอียดโปรเจกต์ หรือไอเดียการร่วมงาน",
      "required": "จำเป็น",
      "sendMessage": "ส่งข้อความ",
      "sending": "กำลังส่งข้อความ...",
      "sent": "ส่งข้อความแล้ว!",
      "success": {
        "title": "ส่งข้อความสำเร็จ!",
        "description": "ฉันจะติดต่อกลับโดยเร็วที่สุด"
      },
      "error": {
        "title": "ไม่สามารถส่งข้อความได้",
        "network": "เกิดข้อผิดพลาดเครือข่าย กรุณาตรวจสอบการเชื่อมต่อและลองใหม่",
        "validation": "กรุณาตรวจสอบข้อมูลที่กรอกและลองใหม่",
        "rateLimit": "ส่งข้อความมากเกินไป กรุณารอสักครู่ก่อนลองใหม่",
        "cooldown": "กรุณารอสักครู่ก่อนส่งใหม่"
      },
      "validation": {
        "nameRequired": "จำเป็นต้องกรอกชื่อ",
        "nameMinLength": "ชื่อต้องมีอย่างน้อย 2 ตัวอักษร",
        "nameMaxLength": "ชื่อต้องไม่เกิน 50 ตัวอักษร",
        "namePattern": "ชื่อสามารถใช้ได้เฉพาะตัวอักษร ช่องว่าง เครื่องหมายขีด เครื่องหมายอะพอสทรอฟี และจุด",
        "emailRequired": "จำเป็นต้องกรอกอีเมล",
        "emailInvalid": "กรุณากรอกอีเมลที่ถูกต้อง",
        "emailMaxLength": "อีเมลต้องไม่เกิน 100 ตัวอักษร",
        "messageRequired": "จำเป็นต้องกรอกข้อความ",
        "messageMinLength": "ข้อความต้องมีอย่างน้อย 10 ตัวอักษร",
        "messageMaxLength": "ข้อความต้องไม่เกิน 1000 ตัวอักษร"
      },
      "draft": "บันทึกร่างอัตโนมัติแล้ว",
      "keyboardShortcut": "กด Ctrl + Enter เพื่อส่งด่วน",
      "allFieldsRequired": "จำเป็นต้องกรอกทุกช่อง",
      "characterCount": "ตัวอักษร",
      "approachingLimit": "ใกล้ถึงขีดจำกัด",
      "overLimit": "เกินขีดจำกัด"
    },
    "social": {
      "title": "ติดต่อกับฉัน",
      "linkedin": "LinkedIn",
      "github": "GitHub",
      "twitter": "Twitter",
      "line": "Line"
    }
  },
  "projects": {
    "title": "Featured Projects",
    "categories": {
      "webDevelopment": "พัฒนาเว็บไซต์",
      "mobileDevelopment": "พัฒนาแอปมือถือ",
      "dataScience": "วิทยาการข้อมูล"
    },
    "organizationTodoSystem": {
      "title": "ระบบจัดการงานภายในองค์กร",
      "description": "พัฒนาระบบจัดการงานภายในองค์กรที่สามารถสร้าง มอบหมาย และติดตามสถานะของงานได้อย่างมีประสิทธิภาพ",
      "detailTitle": "ระบบ ToDo List สำหรับงานภายในองค์กร",
      "detailDescription": "ระบบนี้ช่วยให้ผู้ดูแลสามารถสร้างงาน มอบหมายให้พนักงาน และติดตามความคืบหน้าของแต่ละงานได้ผ่านแดชบอร์ด พร้อมทั้งให้ผู้ใช้งานสามารถดูสรุปงานของตนเองและปิดงานที่เสร็จสมบูรณ์ได้",
      "role": "ในฐานะ Full Stack Developer รับผิดชอบการพัฒนา UI ระบบแดชบอร์ด การจัดการผู้ใช้งาน การจัดการงาน และระบบฐานข้อมูลทั้งหมด"
    },
    "solvaGoTravel": {
      "title": "solva-go-travel",
      "description": "แอปวางแผนการเดินทางที่ช่วยให้ผู้ใช้ค้นหาสถานที่ท่องเที่ยว วางแผนทริป และแบ่งปันประสบการณ์การเดินทาง",
      "detailTitle": "แอปพลิเคชันวางแผนการเดินทาง",
      "detailDescription": "พัฒนาแอปพลิเคชันวางแผนการเดินทางแบบครบวงจรที่ให้ผู้ใช้สำรวจจุดหมายปลายทาง สร้างแผนการเดินทาง และแบ่งปันประสบการณ์กับผู้อื่น",
      "role": "ฉันรับหน้าที่เป็นสถาปนิกส่วนหน้าและนักพัฒนาหลักในโปรเจกต์นี้ รับผิดชอบออกแบบอินเทอร์เฟซผู้ใช้และสร้างเลย์เอาต์ที่ตอบสนองทุกอุปกรณ์"
    },
    "webDevService": {
      "title": "บริการพัฒนาเว็บไซต์",
      "description": "บริการพัฒนาเว็บไซต์สำหรับธุรกิจและสตาร์ทอัพ",
      "detailTitle": "โซลูชันพัฒนาเว็บไซต์ครบวงจร",
      "detailDescription": "ให้บริการพัฒนาเว็บไซต์ด้วยเทคโนโลยีสมัยใหม่และแนวทางที่ดีที่สุด",
      "role": "หัวหน้าทีมพัฒนา ดูแลสถาปัตยกรรม การพัฒนา และการนำขึ้นใช้งาน"
    },
    "personalBlog": {
      "title": "บล็อกส่วนตัว",
      "description": "ออกแบบและพัฒนาบล็อกส่วนตัวพร้อม CMS กำหนดเอง ทำให้สามารถสร้างและจัดการเนื้อหาได้อย่างง่ายดาย",
      "detailTitle": "บล็อกส่วนตัวพร้อมระบบจัดการเนื้อหากำหนดเอง",
      "detailDescription": "สร้างแพลตฟอร์มบล็อกส่วนตัวที่ทันสมัยพร้อมระบบจัดการเนื้อหากำหนดเอง บล็อกมีการออกแบบที่สะอาดและตอบสนอง รองรับ markdown ระบบความคิดเห็น และการเพิ่มประสิทธิภาพ SEO ผู้ใช้สามารถสร้าง แก้ไข และเผยแพร่โพสต์บล็อกพร้อมเนื้อหามีเดียที่หลากหลายได้อย่างง่ายดาย",
      "role": "ฉันเป็นนักพัฒนาเพียงคนเดียวในโปรเจกต์นี้ ดูแลทั้งการออกแบบและการพัฒนา ฉันสร้าง CMS กำหนดเองตั้งแต่เริ่มต้น ใช้งานอินเทอร์เฟซบล็อกส่วนหน้า สร้างแดชบอร์ดผู้ดูแลระบบสำหรับการจัดการเนื้อหา และเพิ่มประสิทธิภาพไซต์สำหรับเครื่องมือค้นหาและประสิทธิภาพ"
    },
    "mobileApp": {
      "title": "แอปติดตามการออกกำลังกาย",
      "description": "สร้างแอปมือถือข้ามแพลตฟอร์มสำหรับการติดตามการออกกำลังกายพร้อมแผนการออกกำลังกาย การตรวจสอบความก้าวหน้า และฟีเจอร์โซเชียล",
      "detailTitle": "แอปพลิเคชันมือถือติดตามการออกกำลังกาย",
      "detailDescription": "พัฒนาแอปพลิเคชันมือถือติดตามการออกกำลังกายที่ครอบคลุมโดยใช้ React Native แอปรวมถึงการวางแผนการออกกำลังกาย การติดตามความก้าวหน้า การบันทึกโภชนาการ ฟีเจอร์โซเชียล และการรวมกับอุปกรณ์สวมใส่ ผู้ใช้สามารถตั้งเป้าหมาย ติดตามการเดินทางการออกกำลังกาย และเชื่อมต่อกับเพื่อนๆ เพื่อแรงบันดาลใจ",
      "role": "ฉันเป็นผู้นำทีมพัฒนามือถือและรับผิดชอบสถาปัตยกรรมแอป การใช้งาน UI/UX การรวมกับ API การออกกำลังกาย และการเพิ่มประสิทธิภาพ ฉันยังจัดการกระบวนการปรับใช้แอปสโตร์สำหรับทั้งแพลตฟอร์ม iOS และ Android"
    },
    "dataVisualization": {
      "title": "แดชบอร์ดการแสดงภาพข้อมูล",
      "description": "สร้างแดชบอร์ดแบบอินเทอร์แอคทีฟสำหรับการแสดงภาพชุดข้อมูลที่ซับซ้อนพร้อมการอัพเดตแบบเรียลไทม์และตัวเลือกการกรองแบบกำหนดเอง",
      "detailTitle": "แดชบอร์ดการแสดงภาพข้อมูลแบบอินเทอร์แอคทีฟ",
      "detailDescription": "สร้างแดชบอร์ดการแสดงภาพข้อมูลที่ซับซ้อนสำหรับการวิเคราะห์ชุดข้อมูลทางธุรกิจที่ซับซ้อน แพลตฟอร์มมีแผนภูมิแบบอินเทอร์แอคทีฟ การอัพเดตข้อมูลแบบเรียลไทม์ ตัวเลือกการกรองแบบกำหนดเอง และความสามารถในการส่งออก ช่วยให้ธุรกิจตัดสินใจโดยใช้ข้อมูลผ่านการแสดงภาพที่ชัดเจนของเมตริกสำคัญ",
      "role": "ฉันเป็นนักพัฒนาส่วนหน้าหลักที่เชี่ยวชาญด้านการแสดงภาพข้อมูล ฉันออกแบบและใช้งานสถาปัตยกรรมแดชบอร์ด สร้างคอมโพเนนต์แผนภูมิแบบกำหนดเอง รวมกับแหล่งข้อมูลหลายแห่ง และเพิ่มประสิทธิภาพสำหรับการจัดการชุดข้อมูลขนาดใหญ่แบบเรียลไทม์"
    },
    "buttonText": "ดูโปรเจกต์",
    "sections": {
      "myRole": "บทบาทของฉัน",
      "technologiesUsed": "เทคโนโลยีที่ใช้",
      "visualShowcase": "การแสดงผลงาน"
    }
  },
  "about-me": {
    "title": "เกี่ยวกับฉัน",
    "description": "ผมเป็นนักพัฒนา Full-Stack ที่ทุ่มเท มีประสบการณ์ 2 ปีในการสร้างเว็บแอปพลิเคชันที่มีความไดนามิก ความเชี่ยวชาญของผมครอบคลุมทั้งเทคโนโลยีฝั่งหน้าและฝั่งหลัง ช่วยให้ผมสามารถพัฒนาโซลูชันครบวงจรที่ตอบโจทย์ความต้องการหลากหลายของโปรเจกต์ได้อย่างเหมาะสม ผมมีความหลงใหลในการสร้างแอปพลิเคชันที่มีประสิทธิภาพและใช้งานง่าย",
    "Education": {
      "title": "การศึกษา",
      "degree": "ปริญญาตรีวิทยาการคอมพิวเตอร์",
      "university": "มหาวิทยาลัยเจ้าพระยา"
    },
    "Experience": {
      "title": "ประสบการณ์",
      "years": "2 ปี",
      "waylar": "Waylar Corporation",
      "waylarPosition": "Full-Stack Developer (2023 - ปัจจุบัน)",
      "waylarDescription": "รับผิดชอบการพัฒนาและดูแลเว็บไซต์หลักของบริษัท รวมถึงระบบบริหารจัดการขนส่งภายในองค์กร ทำงานร่วมกับทีมข้ามสายงานเพื่อรวบรวมความต้องการและส่งมอบงานให้ตรงเป้าหมาย",
      "UTE": " UTE (University of Technology and Education at Da Nang) ",
      "UTEDescription": "เข้าร่วมฝึกงานเต็มเวลาโดยมุ่งเน้นด้านการพัฒนาซอฟต์แวร์ ได้รับประสบการณ์การทำงานข้ามวัฒนธรรมและพัฒนาทักษะการสื่อสารในสภาพแวดล้อมนานาชาติ",
      "UTEPosition": "นักศึกษาฝึกงาน (2022)",
      "plantEquipment": "Plant Equipment Co., Ltd.",
      "plantEquipmentPosition": "นักศึกษาฝึกงาน (2022)",
      "plantEquipmentDescription": "ช่วยพัฒนาระบบบริหารจัดการภายในเพื่อให้การดำเนินงานเป็นไปอย่างมีประสิทธิภาพ พัฒนาเครื่องมือบนเว็บสำหรับจัดการข้อมูลพนักงาน รายงาน และการจัดสรรทรัพยากร ทำงานร่วมกับพนักงานบริษัทอย่างใกล้ชิดเพื่อรวบรวมความต้องการและนำไปสู่การแก้ไขปัญหา"
    }
  }
}
