{
  "common": {
    "home": "Trang chủ",
    "about": "Về tôi",
    "portfolio": "Danh mục",
    "contact": "Liên hệ",
    "language": "Ngôn ngữ"
  },
  "navigation": {
    "home": "Trang chủ",
    "about": "Về tôi",
    "portfolio": "Danh mục",
    "contact": "Liên hệ"
  },
  "home": {
    "title": "Danh mục cá nhân",
    "profile": {
      "name": "Tawan Chankachang",
      "title": "Lập trình viên Full-Stack",
      "experience": "2 năm kinh nghiệm",
      "description": "Tôi chuyên phát triển các ứng dụng web động sử dụng công nghệ hiện đại. Thành thạo phát triển frontend với React, backend với Node.js và quản lý cơ sở dữ liệu bằng PostgreSQL. Tôi đam mê xây dựng các giải pháp có thể mở rộng và thân thiện với người dùng.",
      "viewWork": "Xem công việc của tôi"
    }
  },
  "about": {
    "title": "Về tôi",
    "skills": "Kỹ năng",
    "experience": "Kinh nghiệm",
    "education": "Học vấn",
    "share": "Chia sẻ"
  },
  "portfolio": {
    "title": "Danh mục",
    "projects": "Dự án",
    "viewProject": "Xem dự án",
    "projectDetails": "Chi tiết dự án",
    "technologies": "Công nghệ",
    "category": {
      "webDevelopment": "Phát triển Web",
      "mobileApp": "Ứng dụng di động",
      "uiDesign": "Thiết kế UI/UX"
    }
  },
  "contact": {
    "title": "Liên hệ",
    "getInTouch": "Liên hệ với tôi bất cứ lúc nào",
    "description": "Tôi hiện đang tìm kiếm cơ hội mới và rất mong nhận được liên hệ từ bạn. Dù là một ý tưởng dự án hay đơn giản chỉ là muốn kết nối, hãy thoải mái liên hệ.",
    "form": {
      "name": "Họ và tên",
      "email": "Email",
      "message": "Tin nhắn",
      "namePlaceholder": "Họ và tên của bạn",
      "emailPlaceholder": "your.email@example.com",
      "messagePlaceholder": "Chia sẻ về dự án, ý tưởng hoặc đơn giản là chào hỏi!",
      "nameHelp": "Hãy nhập tên bạn muốn được gọi",
      "emailHelp": "Chúng tôi sẽ dùng email này để phản hồi bạn",
      "messageHelp": "Hãy chia sẻ ý tưởng, chi tiết dự án hoặc đề xuất hợp tác",
      "required": "Bắt buộc",
      "sendMessage": "Gửi tin nhắn",
      "sending": "Đang gửi tin nhắn...",
      "sent": "Đã gửi thành công!",
      "success": {
        "title": "Tin nhắn đã được gửi!",
        "description": "Tôi sẽ phản hồi bạn sớm nhất có thể."
      },
      "error": {
        "title": "Không thể gửi tin nhắn",
        "network": "Đã xảy ra lỗi mạng. Vui lòng kiểm tra kết nối và thử lại.",
        "validation": "Vui lòng kiểm tra thông tin và thử lại.",
        "rateLimit": "Bạn đã gửi quá nhiều lần. Vui lòng chờ một lúc.",
        "cooldown": "Vui lòng đợi và thử lại sau."
      },
      "validation": {
        "nameRequired": "Họ và tên là bắt buộc",
        "nameMinLength": "Tên phải có ít nhất 2 ký tự",
        "nameMaxLength": "Tên không được vượt quá 50 ký tự",
        "namePattern": "Tên chỉ được chứa chữ cái, khoảng trắng, dấu gạch nối, dấu nháy đơn và dấu chấm",
        "emailRequired": "Email là bắt buộc",
        "emailInvalid": "Vui lòng nhập đúng định dạng email",
        "emailMaxLength": "Email không được vượt quá 100 ký tự",
        "messageRequired": "Tin nhắn là bắt buộc",
        "messageMinLength": "Tin nhắn phải có ít nhất 10 ký tự",
        "messageMaxLength": "Tin nhắn không được vượt quá 1000 ký tự"
      },
      "draft": "Bản nháp đã được lưu tự động",
      "keyboardShortcut": "Ctrl + Enter để gửi nhanh",
      "allFieldsRequired": "Tất cả các trường đều bắt buộc",
      "characterCount": "ký tự",
      "approachingLimit": "Gần đạt giới hạn",
      "overLimit": "Vượt quá giới hạn"
    },
    "social": {
      "title": "Kết nối với tôi",
      "linkedin": "LinkedIn",
      "github": "GitHub",
      "twitter": "Twitter"
    }
  },
  "projects": {
    "title": "Featured Projects",
    "categories": {
      "webDevelopment": "Phát triển web",
      "mobileDevelopment": "Phát triển ứng dụng di động",
      "dataScience": "Khoa học dữ liệu"
    },
    "organizationTodoSystem": {
      "title": "Hệ thống quản lý công việc trong tổ chức",
      "description": "Phát triển hệ thống quản lý công việc cho tổ chức, cho phép tạo, phân công và theo dõi tiến độ công việc một cách hiệu quả.",
      "detailTitle": "Hệ thống ToDo List cho công việc nội bộ tổ chức",
      "detailDescription": "Hệ thống này cho phép quản trị viên tạo và phân công công việc cho nhân viên, theo dõi tiến độ qua bảng điều khiển, đồng thời người dùng có thể xem tổng quan công việc cá nhân và đánh dấu hoàn thành công việc.",
      "role": "Với vai trò là lập trình viên full-stack, tôi chịu trách nhiệm phát triển giao diện bảng điều khiển, quản lý người dùng, tính năng quản lý công việc và toàn bộ hệ thống cơ sở dữ liệu."
    },
    "socialMediaDashboard": {
      "title": "Bảng điều khiển mạng xã hội",
      "description": "Tạo bảng điều khiển mạng xã hội để quản lý nhiều tài khoản, lên lịch bài đăng và phân tích số liệu tương tác.",
      "detailTitle": "Bảng điều khiển quản lý mạng xã hội",
      "detailDescription": "Phát triển nền tảng quản lý mạng xã hội toàn diện, giúp doanh nghiệp quản lý nhiều tài khoản mạng xã hội, lên lịch bài đăng, theo dõi số liệu tương tác và phân tích hiệu quả trên các nền tảng như Facebook, Twitter, Instagram và LinkedIn.",
      "role": "Tôi là kiến trúc sư frontend và nhà phát triển chính cho dự án này. Trách nhiệm của tôi bao gồm thiết kế giao diện người dùng, triển khai các thành phần biểu diễn dữ liệu theo thời gian thực, tích hợp với nhiều API mạng xã hội và tạo bảng điều khiển đáp ứng hoạt động mượt mà trên mọi thiết bị."
    },
    "personalBlog": {
      "title": "Blog cá nhân",
      "description": "Thiết kế và phát triển blog cá nhân với CMS tùy chỉnh, giúp dễ dàng tạo và quản lý nội dung.",
      "detailTitle": "Blog cá nhân với hệ thống quản lý nội dung tùy chỉnh",
      "detailDescription": "Xây dựng nền tảng blog cá nhân hiện đại với CMS tùy chỉnh. Blog có thiết kế sạch sẽ, đáp ứng, hỗ trợ markdown, hệ thống bình luận và tối ưu SEO. Người dùng có thể tạo, chỉnh sửa và xuất bản bài viết cùng nội dung đa phương tiện một cách dễ dàng.",
      "role": "Tôi là nhà phát triển duy nhất trong dự án này, đảm nhiệm từ thiết kế đến phát triển. Tôi xây dựng CMS tùy chỉnh từ đầu, tạo giao diện frontend của blog, phát triển bảng điều khiển quản trị để quản lý nội dung và tối ưu trang cho công cụ tìm kiếm cũng như hiệu năng."
    },
    "mobileApp": {
      "title": "Ứng dụng theo dõi tập luyện",
      "description": "Tạo ứng dụng di động đa nền tảng để theo dõi tập luyện với kế hoạch tập luyện, giám sát tiến trình và các tính năng xã hội.",
      "detailTitle": "Ứng dụng di động theo dõi tập luyện",
      "detailDescription": "Phát triển ứng dụng di động theo dõi tập luyện toàn diện bằng React Native. Ứng dụng bao gồm lập kế hoạch tập luyện, theo dõi tiến trình, ghi chép dinh dưỡng, tính năng xã hội và tích hợp với thiết bị đeo thông minh. Người dùng có thể đặt mục tiêu, theo dõi hành trình tập luyện và kết nối với bạn bè để tăng động lực.",
      "role": "Tôi là trưởng nhóm phát triển di động, chịu trách nhiệm kiến trúc ứng dụng, triển khai UI/UX, tích hợp API tập luyện và tối ưu hóa hiệu năng. Tôi cũng quản lý quy trình triển khai ứng dụng lên App Store cho cả iOS và Android."
    },
    "dataVisualization": {
      "title": "Bảng điều khiển trực quan hóa dữ liệu",
      "description": "Tạo bảng điều khiển tương tác để trực quan hóa bộ dữ liệu phức tạp với cập nhật thời gian thực và tùy chọn lọc nâng cao.",
      "detailTitle": "Bảng điều khiển trực quan hóa dữ liệu tương tác",
      "detailDescription": "Xây dựng bảng điều khiển trực quan hóa dữ liệu phức tạp cho việc phân tích các bộ dữ liệu kinh doanh phức tạp. Nền tảng có biểu đồ tương tác, cập nhật dữ liệu thời gian thực, tùy chọn lọc tùy chỉnh và khả năng xuất dữ liệu, giúp doanh nghiệp đưa ra quyết định dựa trên dữ liệu thông qua hình ảnh hóa rõ ràng các chỉ số quan trọng.",
      "role": "Tôi là nhà phát triển frontend chính chuyên về trực quan hóa dữ liệu. Tôi thiết kế và triển khai kiến trúc bảng điều khiển, xây dựng các thành phần biểu đồ tùy chỉnh, tích hợp với nhiều nguồn dữ liệu và tối ưu hóa để xử lý bộ dữ liệu lớn theo thời gian thực."
    },
    "buttonText": "Xem dự án",
    "sections": {
      "myRole": "Vai trò của tôi",
      "technologiesUsed": "Công nghệ sử dụng",
      "visualShowcase": "Trình diễn dự án"
    }
  }
}
